In [44]:
import pandas as pd
from bs4 import BeautifulSoup
import requests
import time

In [45]:
from selenium import webdriver

In [46]:
driver=webdriver.Chrome("C:\\Users\\Preeti kumari\\chromedriver.exe")

<ipython-input-46-56a44a4849dd>:1: DeprecationWarning: executable_path has been deprecated, please pass in a Service object
  driver=webdriver.Chrome("C:\\Users\\Preeti kumari\\chromedriver.exe")

In [47]:
url="https://www.naukri.com/data-analyst-jobs-in-bangalore?k=data%20analyst&l=bangalore"

In [48]:
driver.get(url)

In [49]:
soup= BeautifulSoup(driver.page_source, 'html.parser')

In [50]:
for i in soup.find_all('a',class_="title fw500 ellipsis"):
    title.append(i.text)
for i in soup.find_all('li',class_="fleft grey-text br2 placeHolderLi location"):
    location.append(i.text)
for i in soup.find_all('li',class_="fleft grey-text br2 placeHolderLi experience"):
    experience.append(i.text)
for i in soup.find_all('a',class_="subTitle ellipsis fleft"):
    company_name.append(i.text)
#scrapping data

In [51]:
title=title[0:10]
location=location[0:10]
company_name=company_name[0:10]
experience=experience[0:10]
#saving first 10

In [52]:
data=list(zip(title,location,company_name,experience))
#zipping al the data togethe

In [53]:
df=pd.DataFrame(data,columns=["Title","Location","Company name","experience"])
#converting into dataframe

In [54]:
df

,Title,Location,Company name,experience
0,"MIS/ Data Analyst-(SQL,Automation,Excel/PowerB...",Bengaluru,Flipkart Internet Private Limited,1-4 Yrs
1,Data Analyst - SAP,"Pune, Delhi, Bengaluru, Gurgaon",Boston Scientific Corporation,3-5 Yrs
2,Hiring Data Analysts on Contract,Bengaluru,Flipkart Internet Private Limited,2-5 Yrs
3,Senior Data Analyst,Bengaluru / Bangalore,Schneider Electric,2-5 Yrs
4,Data Analyst,Bengaluru,Shell India Markets Private Limited,5-8 Yrs
5,Security Data Analyst,Bengaluru,Philips India Limited,2-4 Yrs
6,"Data Analyst -Azure Data lake, Azure Data factory","Chennai, Pune, Bengaluru, Hyderabad",Mindtree Limited,5-9 Yrs
7,Business / Data Analyst,Bengaluru,IBM India Pvt. Limited,2-4 Yrs
8,Data Analyst - O2C - Bangalore,Bengaluru,RANDSTAD INDIA PVT LTD,2-4 Yrs
9,Intern Data Analyst,Bengaluru,Outsource Big Data,0-1 Yrs